src/cf/MainBase/DataProcessors/otus_ОбменСоВторойБазой.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<DataProcessor>
		<Properties>
			<Name>otus_ОбменСоВторойБазой</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

src/cf/MainBase/InformationRegisters/otus_СписокПисем.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<InformationRegister>
		<Properties>
			<Name>otus_СписокПисем</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.otus_СтатусОтправки</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Письмо</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.otus_ПисьмоПретензии</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/MainBase/Enums/otus_СтатусОтправки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<Enum>
		<Properties>
			<Name>otus_СтатусОтправки</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>КОтправке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отправлено</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/MainBase/Documents/otus_ПисьмоПретензии.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<Document>
		<Properties>
			<Name>otus_ПисьмоПретензии</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АктПередачи</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.otus_АктПередачиТовара</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/cf/MainBase/Documents/otus_АктПередачиТовара.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<Document>
		<Properties>
			<Name>otus_АктПередачиТовара</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ТоварныеЗапасы</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.otus_Договор</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПередачи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВозврата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.otus_СтатусАкта</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заявка</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.otus_Заявка</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СписокТоваров</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Товар</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Товары</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>4</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/cf/MainBase/Catalogs/otus_Договор.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<Catalog>
		<Properties>
			<Name>otus_Договор</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидДоговора</Name>
					<Type>
						<v8:Type>cfg:EnumRef.otus_ВидДоговора</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗаключения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПередачиТовара</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоДней</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.otus_СтатусДоговоров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/MainBase/Catalogs/Контрагенты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<Catalog>
		<Properties>
			<Name>Контрагенты</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Регион</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Регионы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Индекс</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Страна</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Город</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Улица</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Дом</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Телефон</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>16</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭлектроннаяПочта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Факс</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>16</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВебСайт</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидЦен</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДополнительнаяИнформация</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтактноеЛицо</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Широта</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Долгота</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>otus_Специализация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.otus_Специализации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/MainBase/DataProcessors/otus_ОбменСоВторойБазой/Forms/Форма/Ext/Form/Module.bsl
&НаКлиенте
Процедура ВыполнитьОбмен(Команда)
	ВыполнитьОбменНаСервере();
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьДанныеДляОтправки()
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	otus_ПисьмоПретензии.Номер КАК НомерПисьма,
	               |	otus_ПисьмоПретензии.Дата КАК ДатаПисьма,
	               |	Контрагенты.Наименование КАК Контрагент,
	               |	Контрагенты.Телефон КАК КонтрагентТелефон,
	               |	Контрагенты.ЭлектроннаяПочта КАК КонтрагентЭлектроннаяПочта,
	               |	otus_Договор.Номер КАК НомерДоговора,
	               |	otus_Договор.ДатаЗаключения КАК ДатаЗаключенияДоговора,
	               |	Контрагенты.Ссылка КАК СсылкаКонтрагент,
	               |	otus_Договор.Ссылка КАК СсылкаДоговор,
	               |	otus_ПисьмоПретензии.Ссылка КАК СсылкаПисьмо,
	               |	otus_АктПередачиТовара.Ссылка КАК Ссылка
	               |ИЗ
	               |	РегистрСведений.otus_СписокПисем.СрезПоследних(&Период, ) КАК otus_СписокПисемСрезПоследних
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.otus_ПисьмоПретензии КАК otus_ПисьмоПретензии
	               |			ЛЕВОЕ СОЕДИНЕНИЕ Документ.otus_АктПередачиТовара КАК otus_АктПередачиТовара
	               |				ЛЕВОЕ СОЕДИНЕНИЕ Справочник.otus_Договор КАК otus_Договор
	               |				ПО otus_АктПередачиТовара.Договор = otus_Договор.Ссылка
	               |			ПО otus_ПисьмоПретензии.АктПередачи = otus_АктПередачиТовара.Ссылка
	               |		ПО otus_СписокПисемСрезПоследних.Письмо = otus_ПисьмоПретензии.Ссылка
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
	               |		ПО otus_СписокПисемСрезПоследних.Контрагент = Контрагенты.Ссылка
	               |ГДЕ
	               |	otus_СписокПисемСрезПоследних.Статус = ЗНАЧЕНИЕ(Перечисление.otus_СтатусОтправки.КОтправке)"; 
	Запрос.УстановитьПараметр("Период",ТекущаяДата());
	
	
	Возврат Запрос.Выполнить();
	
	
КонецФункции	

Процедура ВыполнитьОбменНаСервере()
	
	Старт = ТекущаяДата();
	//
	Заголовки = Новый Соответствие;
	Заголовки.Вставить("content-type","application/json; charset=utf-8");
	//
	httpЗапрос = Новый httpЗапрос("/api/exchanges/%2F/OTUS_Test/publish",Заголовки);
	//
	httpСоединение = Новый httpСоединение("192.168.0.112",15672,"admin","Tgbhu890",,,,);
	Реквизит1 = "";

	РезультатЗапроса = ПолучитьДанныеДляОтправки();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл            
		
		ДанныеСообщения = ЗаписатьЗначениеJSON(Выборка);
		ПараметрыЗаписиJSON = Новый ПараметрыЗаписиJSON(, Символы.Таб);
		ЗаписьJSON = Новый ЗаписьJSON;
		ЗаписьJSON.УстановитьСтроку(ПараметрыЗаписиJSON);
		ЗаписатьJSON(ЗаписьJSON,ДанныеСообщения);
		РезультатДанных = ЗаписьJSON.Закрыть();
		
		Сообщение = Новый Структура("properties,routing_key,payload,payload_encoding",Новый Структура(),"letters.all",РезультатДанных,"string");
		Реквизит1 = ДанныеВJSON(Сообщение); 
		httpЗапрос.УстановитьТелоИзСтроки(ДанныеВJSON(Сообщение));
		Ответ = httpСоединение.ВызватьHTTPМетод("POST",httpЗапрос);
		
		ЗаписьРегистр = РегистрыСведений.otus_СписокПисем.СоздатьНаборЗаписей();
		
		ЗаписьРегистр.Отбор.Письмо.Установить(Выборка.СсылкаПисьмо);
		ЗаписьРегистр.Отбор.Контрагент.Установить(Выборка.СсылкаКонтрагент);
		ЗаписьРегистр.Прочитать();
		
		Для Каждого Запись Из ЗаписьРегистр Цикл
			Запись.Период = ТекущаяДата();
			Запись.Письмо = Выборка.СсылкаПисьмо;
			Запись.Контрагент = Выборка.СсылкаКонтрагент;
			Запись.Ответственный = ПараметрыСеанса.ТекущийПользователь;
			Запись.Статус = Перечисления.otus_СтатусОтправки.Отправлено;
			
			ЗаписьРегистр.Записать(Ложь);  
		КонецЦикла;
	КонецЦикла;	
	
КонецПроцедуры 

Функция ЗаписатьЗначениеJSON(ЭлементВыборки)
	
	
	СоответствиеЗначений = Новый Структура();
	
	СоответствиеЗначений.Вставить("УИДПисьма",Строка(ЭлементВыборки.СсылкаПисьмо.УникальныйИдентификатор()));
	СоответствиеЗначений.Вставить("НомерПисьма",ЭлементВыборки.НомерПисьма);
	СоответствиеЗначений.Вставить("ДатаПисьма",Формат(ЭлементВыборки.ДатаПисьма,"ДЛФ=Д"));
	СоответствиеЗначений.Вставить("УИДКонтрагент",Строка(ЭлементВыборки.СсылкаКонтрагент.УникальныйИдентификатор()));
	СоответствиеЗначений.Вставить("Контрагент",ЭлементВыборки.Контрагент);
	СоответствиеЗначений.Вставить("КонтрагентТелефон",ЭлементВыборки.КонтрагентТелефон);
	СоответствиеЗначений.Вставить("КонтрагентЭлектроннаяПочта",ЭлементВыборки.КонтрагентЭлектроннаяПочта);
	СоответствиеЗначений.Вставить("УИДДоговор",Строка(ЭлементВыборки.СсылкаДоговор.УникальныйИдентификатор()));
	СоответствиеЗначений.Вставить("НомерДоговора",ЭлементВыборки.НомерДоговора);
	СоответствиеЗначений.Вставить("ДатаЗаключенияДоговора",Формат(ЭлементВыборки.ДатаЗаключенияДоговора,"ДЛФ=Д"));
	Товары = ПолучитьТаблицуТоваров(ЭлементВыборки.Ссылка);
	СоответствиеЗначений.Вставить("Товары",Товары);
	Возврат СоответствиеЗначений; 
	
КонецФункции 

&НаСервереБезКонтекста
Функция ПолучитьТаблицуТоваров(Акт)
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	Товары.Наименование КАК Наименование,
	|	Товары.Ссылка КАК УИД,
	|	otus_АктПередачиТовараСписокТоваров.Количество КАК Количество
	|ИЗ
	|	Документ.otus_АктПередачиТовара.СписокТоваров КАК otus_АктПередачиТовараСписокТоваров
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Товары КАК Товары
	|		ПО (otus_АктПередачиТовараСписокТоваров.Товар = Товары.Ссылка)
	|ГДЕ
	|	otus_АктПередачиТовараСписокТоваров.Ссылка = &Ссылка
	|";  
	
	Запрос.УстановитьПараметр("Ссылка",Акт);
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	ВыходнаяСтруктура = Новый Структура();
	
	СписокКолонок = "";
	Для Каждого Колонка Из РезультатЗапроса.Колонки Цикл
		СписокКолонок = СписокКолонок + ?(СписокКолонок="","",",")+Колонка.Имя;
	КонецЦикла;
	
	Для Каждого СтрокаТЗ ИЗ РезультатЗапроса Цикл
 		Товары = Новый Структура(СписокКолонок);
		
		Товары.Вставить("Количество",СтрокаТЗ.Количество);
		Товары.Вставить("Товар",СтрокаТЗ.Наименование);
		Товары.Вставить("УИДТовара",Строка(СтрокаТЗ.УИД.УникальныйИдентификатор()));
		
		ВыходнаяСтруктура.Вставить("Строка"+РезультатЗапроса.Индекс(СтрокаТЗ),Товары);
	КонецЦикла;
	
	Возврат ВыходнаяСтруктура;
	
	
КонецФункции	

Функция ДанныеВJSON(Значение, Знач ПараметрыЗаписиJSON = Неопределено, НастройкиСериализации = Неопределено) Экспорт
	Если ПараметрыЗаписиJSON = Неопределено Тогда
	    ПараметрыЗаписиJSON = Новый ПараметрыЗаписиJSON(, Символы.Таб);
	КонецЕсли;
    
    ЗаписьJSON = Новый ЗаписьJSON();
	ЗаписьJSON.УстановитьСтроку(ПараметрыЗаписиJSON); 
    ЗаписатьJSON(ЗаписьJSON, Значение, НастройкиСериализации);
    Результат = ЗаписьJSON.Закрыть();    
    
    Возврат Результат;
КонецФункции
